#+STARTUP: overview
#+OPTIONS: toc:nil
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[backend=biber,style=ieee]{biblatex}
#+LATEX_HEADER: \addbibresource{references.bib}
#+BIBLIOGRAPHY: references.bib

*** Normalization
:PROPERTIES:
:ID:       b7872bb2-b785-4b71-bfde-4da8c3766f6a
:END:
Neural networks perform best when input features are on a similar, small scale and centered around zero. To achieve this, we use *standardization*, which rescales the data to have a mean of 0 and a standard deviation of 1.

The process of normalization takes each feature map and calculates the
mean and standard deviation of the columns.

Consider this 5, made up feature maps:
#+NAME: features
| Feature |      val1 |      val2 |      val3 |      val4 |      val5 |
|---------+-----------+-----------+-----------+-----------+-----------|
|       1 |         4 |         6 |         1 |         7 |       4.5 |
|       2 |         2 |        10 |        12 |        88 |      28.0 |
|       3 |         1 |        12 |        31 |         9 |      13.2 |
|       4 |         5 |        15 |         4 |        10 |       8.5 |
|       5 |         2 |         2 |        15 |        11 |       7.5 |
|---------+-----------+-----------+-----------+-----------+-----------|
|    mean |         3 |     10.75 |        12 |      28.5 |     13.55 |
| std dev | 1.8257419 | 3.7749172 | 13.490738 | 39.686270 | 10.268560 |
#+TBLFM: @>>$2..@>>$6=vmean(@2..@5)::@>$2..@>$6=vsdev(@2..@5)

Using the formula:
#+NAME: eq:normalization
\begin{equation}
norm = \frac{(x - \mu)}{\sigma}
\end{equation}


where /x/ is the value .

| Feature |        val1 |        val2 |        val3 |        val4 |         val5 |
|---------+-------------+-------------+-------------+-------------+--------------|
|       1 |  0.54772255 |  -1.2583057 | -0.81537422 | -0.54174907 |  -0.88133098 |
|       2 | -0.54772255 | -0.19867985 |          0. |   1.4992591 |    1.4072080 |
|       3 |  -1.0954451 |  0.33113309 |   1.4083737 | -0.49135381 | -0.034084623 |
|       4 |   1.0954451 |   1.1258525 | -0.59299943 | -0.46615618 |  -0.49179242 |
|       5 | -0.54772255 |  -2.3179316 |  0.22237479 | -0.44095855 |  -0.58917706 |
|---------+-------------+-------------+-------------+-------------+--------------|
#+TBLFM: $2=(remote(features,@@#$2) - remote(features,@7$2)) / remote(features,@8$2)::$3=(remote(features,@@#$3) - remote(features,@7$3)) / remote(features,@8$3)::$4=(remote(features,@@#$4) - remote(features,@7$4)) / remote(features,@8$4)::$5=(remote(features,@@#$5) - remote(features,@7$5)) / remote(features,@8$5)::$6=(remote(features,@@#$6) - remote(features,@7$6)) / remote(features,@8$6)

This also gives each feature value a common ground so that no feature
value will have a large weight due to its larger value.  It is however
very important that the same /mean/ and /std/ that was produced during
training, is also used when running test/validation or inference.
(As the author of this report can attest)

